import React, {useRef} from "react";
import "bootstrap/dist/css/bootstrap.min.css";
import './App.css';
import { Container, Button, Table } from "react-bootstrap";
import { BrowserRouter, Routes, Route, NavLink } from "react-router-dom";
import Contact from "./Contact";

export function Layout() {
  return (
  <nav className="bg-warning p-2 mb-3 text-auto">
    <img src={"f0401.jpg"} width={"auto"} height={"20px"}/>
    <NavLink to="/" className="link px-2" style={({isActive}) => {
      return {
        textDecoration : "none"
      };
    }}>หน้าแรก</NavLink>
    <NavLink to="/product" className="link px-2" style={({isActive}) => {
      return {
        textDecoration : "none"
      };
    }}>ตารางเทียบแคลอรี่</NavLink>
    <NavLink to="/contact" className="link px-2" style={({isActive}) => {
      return {
        textDecoration : "none"
      };
    }}>ผู้จัดทำ</NavLink>
  </nav>
  );
}

function food01() {
  return (
    <>
    <img src="f0401.jpg"style={{width: 180, height: 180, borderRadius: "50%"}}/>
    <div>
    <h2>หลนเค็มบักนัด</h2>
    <p>หลนเค็มบักนัด เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์เฉพาะของจังหวัดอุบลราชธานี เป็นภูมิปัญญาในการถนอมอาหารด้วยวิธี แปรรูป แบบดองเค็มเพื่อให้เก็บไว้ได้นานเป็นปี เป็นอาหารพื้นเมืองโบราณของจังหวัดอุบลราชธานีมาช้านานที่ได้สืบทอดกันมารุ่นต่อรุ่นใช้ส่วนผสมจากวัตถุดิบธรรมชาติที่มีในท้องถิ่นโดยใช้ส่วนผสมหลัก คือ เนื้อปลา ซึ่งปลาที่นำมาเป็นเค็มบักนัด ส่วนใหญ่จะเลือกใช้เนื้อปลาเทโพหรือปลาสวายติดหนัง นำมาหั่นเป็นชิ้นบางๆ เป็นปลาจากแม่น้ำมูลที่ได้จากผืนดินของจังหวัดอุบลราชธานี แล้วนำมาคลุกเคล้ากับเกลือ เป็น “ เกลือสินเธาว์” จะเป็นเกลือจากที่อื่นหรือ “เกลือจากทะเล” ไม่ได้เป็นอันขาด ถ้านำมาใช้จะเกิดการ “เน่าบูด เสียหาย” ไม่เป็น “เค็มบักนัด” ตามที่ต้องการ และหมากนัดก็ต้องเป็น”หมากนัดหม้อ” จากสวนในจังหวัดอุบลราชธานี สับเนื้อหมากนัดสุกที่สับละเอียดไว้ คลุกเคล้าส่วนผสมทุกอย่างให้เข้าเป็นเนื้อเดียวกันแล้วบรรจุใส่ขวด ปิดฝาให้แน่น หมักดองเก็บไว้จนได้ระยะเวลาที่เหมาะสมก็สามารถนำมารับประทานได้ และเนื่องจากเค็มบักนัดแปลงมาจากคำว่า เค็มหมากนัด เป็นภาษาท้องถิ่นชาวอีสานที่ใช้เรียกขานผลไม้ เช่น หมากนัด คือ สับปะรดแต่สำเนียงภาษาของชาวอุบลราชธานีออกเสียงสั้นไปบ้างจึงออกมาเป็นหมากนัดหรือบักนัด จึงตั้งชื่ออาหารว่า “ เค็มบักนัด” เป็นอาหารพื้นเมืองของชาวอุบลราชธานีมาช้านาน
ประโยชน์ของสมุนไพรที่มีสรรพคุณต่อสุขภาพ
     สับปะรดหรือหมากนัด เป็นผลไม้เพื่อสุขภาพ ที่มีประโยชน์อยู่หลากหลาย เพราะอุดมไปด้วยแร่ธาตุและวิตามินต่าง ๆ จำนวนมาก และสรรพคุณสับปะรดทางสมุนไพรนั้น ก็ช่วยรักษาอาการต่าง ๆ ได้อย่างหลากหลายเช่นกัน เพราะเป็นผลไม้ที่มีวิตามินซีจึงช่วยต้านหวัด เสริมสร้างระบบภูมิคุ้มกันในร่างกายให้แข็งแรง สับปะรดยังช่วย ย่อยอาหารจึงแก้อาการท้องผูก ขับถ่ายได้เป็นอย่างดี และมีสรรพคุณช่วยลดความดันโลหิตสูงได้ อีกทั้งรสชาติของเค็มบักนัด จะมีรส เปรี้ยว เค็ม หวาน ที่กลมกล่อมสามารถนำมาปรุงเป็นเมนูอาหารได้หลากหลาย โดยเฉพาะการทำหลนเค็มบักนัด ที่เครื่องปรุงล้วนเป็นสมุนไพรจากธรรมชาติ อาทิ หอมแดง ใบมะกรูด พริกขี้หนู เป็นต้น มีสรรพคุณทางยาทำให้ระบบการเผาผลาญทำงานได้ดี ทำให้ความดันโลหิตต่ำ ลดไขมันในเลือดได้ดี และยังมีส่วนช่วยกระตุ้นระบบการขับถ่ายให้ทำงานอย่างเป็นปกติอีกด้วย
     จึงถือได้ว่า หลนเค็มบักนัด เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ ของความเป็นไทย เป็นกรรมวิธีในการถนอมอาหารของชาวบ้านอีสานสมัยโบราณที่สืบทอดกันมารุ่นต่อรุ่น อย่าง รสเค็มของเกลือสินเธาว์จากภูมิปัญญาในการต้ม เนื้อปลาพื้นบ้านที่หาในแม่น้ำมูลได้ไม่ยาก และได้ความเปรี้ยว หวาน จากสับปะรดในพื้นถิ่นอีสาน ใช้ส่วนผสมจากวัตถุดิบธรรมชาติที่มีในท้องถิ่นที่ผสมผสานรวมกันอย่างลงตัว จนกลายเป็นของหมักของดีถิ่นอีสาน ของจังหวัดอุบลราชธานี
</p>
    </div>
    </>
  );
}

function food02() {
  return (
    <>
    <img src="f0401.jpg"style={{width: 180, height: 180, borderRadius: "50%"}}/>
    <div>
    <h2>แกงเห็ดเผาะไข่มดแดง</h2>
    <p>แกงเห็ดเผาะไข่มดแดง เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น โดยการนำเอาทรัพยากรชีวภาพที่มีอยู่ในท้องถิ่นมาปรุงเป็นอาหารพื้นเมือง ที่มีรสชาติกลมกล่อม เป็นอาหารที่ให้คุณค่าทางโภชนาการ เห็ดเผาะมีโปรตีนและแร่ธาตุต่างๆและสรรพคุณทางยาให้ประโยชน์ช่วยบำรุงร่างกาย ลดอาการร้อนใน เนื่องจากมีฤทธิ์เย็น แก้ช้ำใน แก้ไข้ตัวร้อน ช่วยสมานแผล ลดอาการอักเสบและบวม ช่วยทำให้เลือดแข็งตัวได้เร็วขึ้น บรรเทาอาการคันตามร่างกาย และยังมีส่วนช่วยยับยั้งการเกิดเซลล์มะเร็งอีกด้วย ส่วนไข่มดแดง มีประโยชน์ต่อร่างกายมีคุณค่าทางอาหารสูง โดยเฉพาะโปรตีน ฟอสฟอรัส และแคลเซียม และยังมีสรรพคุณทางยาช่วยระบายท้องและเจริญอาหาร และ ผักหวานเป็น ผักพื้นบ้านสมุนไพร มีคุณค่าทางโภชนาการสูง เป็นแหล่งของโปรตีน วิตามินซี เบต้าแคโรทีนซึ่งช่วยในการมองเห็น บำรุงสายตา และมีสรรพคุณเป็นสารต้านอนุมูลอิสระ ช่วยป้องกันโรคมะเร็ง โรคหัวใจขาดเลือด โรคเบาหวานและ โรคความดันโลหิตสูง มี แคลเซียม และฟอสฟอรัสสูง ช่วยบำรุงกระดูก และฟันให้แข็งแรง และมีเส้นใยอาหารช่วยในการขับถ่ายได้ ซึ่งล้วนแล้วแต่มีประโยชน์ของสมุนไพรที่มีสรรพคุณต่อสุขภาพร่างกายแทบทั้งสิ้น นำเห็ดเผาะ ไข่มดแดง และผักหวานมาแกงผสมผสานเข้ากับน้ำคั้นใบย่านางสีเขียวเข้มที่มีสารต่อต้านอนุมูลอิสระ และมีสรรพคุณ เสริมสร้างภูมิต้านทานโรคในร่างกาย ช่วยขับพิษและลดไข้ ช่วยป้องกันการเกิดโรคหัวใจ ช่วยลดระดับน้ำตาลในเลือด และลดความดันโลหิตสูงได้ ปรุงรสนัวด้วยน้ำปลาร้า เกลือป่น และข้าวคั่วป่นลงไป เติมความเผ็ดด้วยพริกสดสีแดง ที่ช่วยให้ส่วนผสมน้ำแกงรสเผ็ดร้อนเข้มข้นกลมกล่อม กลิ่นหอมจากสมุนไพรสดในเครื่องพริกแกง ได้แก่ ใบแมงลัก ข่า ตะไคร้ ล้วนมีสรรพคุณทางยา มีสารต่อต้านอนุมูลอิสระ ช่วยลดความดันโลหิต ลดไขมันในเลือดได้ดี ยังมีส่วนช่วยกระตุ้นระบบการขับถ่ายให้ทำงานอย่างเป็นปกติอีกด้วย
     จึงถือได้ว่า แกงเห็ดเผาะไข่มดแดง เป็นอาหารพื้นเมือง ที่มีสรรพคุณต่อสุขภาพ ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ ของความเป็นไทย เป็นอาหารที่ใช้วัตถุดิบธรรมชาติที่มีในท้องถิ่นมาปรุงแต่ง และถ่ายทอดภูมิปัญญาอาหารพื้นเมืองมาช้านาน เป็นอาหารแห่งความมีคุณค่าทางโภชนาการ และสรรพคุณทางยาจากพืชผักสมุนไพรพื้นบ้านที่มีประโยชน์นานาชนิด ที่ช่วยเสริมภูมิต้านทานและป้องกันโรค เป็นวัฒนธรรมอาหารที่ควรอนุรักษ์ และยังแสดงออกถึงภูมิปัญญาท้องถิ่น ถือเป็นภูมิปัญญาไทยและมรดกทางวัฒนธรรมอาหารพื้นเมืองที่ต้องรักษาสืบทอดกันต่อไป
     </p>
    </div>
    </>
  );
}

function food03() {
  return (
    <>
    <img src="f0401.jpg"style={{width: 180, height: 180, borderRadius: "50%"}}/>
    <div>
    <h2>หลนเค็มบักนัด</h2>
    <p>หลนเค็มบักนัด เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพตามวิถีภูมิปัญญาท้องถิ่นของจังหวัดอุบลราชธานีมีความโดดเด่นและมีเอกลักษณ์เฉพาะของจังหวัดอุบลราชธานีเป็นภูมิปัญญาในการถนอมอาหารด้วยวิธีแปรรูป แบบดองเค็มเพื่อให้เก็บไว้ได้นานเป็นปี</p>
    </div>
    </>
  );
}

function Index() {
  const header1 = useRef();
  return (
    <>
    <Layout/>
    <h6 className="text-center" ref={header1}>อาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพตามวิถีภูมิปัญญาท้องถิ่นของจังหวัดอุบลราชธานี</h6>
      <div class="img01">
        <div>
        <img src="card-04.jpg"style={{width: 180, height: 180, borderRadius: "50%"}}/>
        <h2>หลนเค็มบักนัด</h2>
        <p>หลนเค็มบักนัด เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพตามวิถีภูมิปัญญาท้องถิ่นของจังหวัดอุบลราชธานีมีความโดดเด่นและมีเอกลักษณ์เฉพาะของจังหวัดอุบลราชธานีเป็นภูมิปัญญาในการถนอมอาหารด้วยวิธีแปรรูป แบบดองเค็มเพื่อให้เก็บไว้ได้นานเป็นปี</p>
        <Button className="bg-secondary" onClick={food01()}>เรียนรู้เพิ่มเติม</Button>
        </div>
        <div>
        <img src="card-05.jpg"style={{width: 180, height: 180, borderRadius: "50%"}}/>
        <h2>แกงเห็ดเผำะไข่มดแดง</h2>
        <p>แกงเห็ดเผาะไข่มดแดง เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น โดยการนำเอาทรัพยากรชีวภาพที่มีอยู่ในท้องถิ่นมาปรุงเป็นอาหารพื้นเมือง ที่มีรสชาติกลมกล่อม เป็นอาหารที่ให้คุณค่าทางโภชนาการ </p>
        <Button className="bg-secondary" onClick={food02()}>เรียนรู้เพิ่มเติม</Button>
        </div>
        <div>
        <img src="card-06.jpg"style={{width: 180, height: 180, borderRadius: "50%"}}/>
        <h2>ผัดไทหมื่นปีห่อใบบัว</h2>
        <p>ผัดไทยเป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่นของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่นมีความโดดเด่นและมีความเป็นเอกลักษณ์ที่มีความประณีตสวยงามของจังหวัดอุบลราชธานี </p>
        <Button className="bg-secondary" onClick={food03()}>เรียนรู้เพิ่มเติม</Button>
        </div>
      </div>
  </>
  );
}

function Product() {
  const table = useRef();
  const tr = useRef([]);
  const AddRow = (i) => {
    const index = tr.current[i].rowIndex;
    table.current.addRow(index);
  }

  const data = [
    ["หลนเค็มบักนัด",250],
    ["แกงเห็ดเผำะไข่มดแดง",250],
    ["ผัดไทหมื่นปีห่อใบบัว",250],
  ]
  return (
    <>
      <Layout/>
      <Table striped bordered hover className="my-3" ref={table}>
        <thead>
          <tr>
            <th>เมนูอาหาร</th>
            <th>พลังงานที่ได้รับ</th>
            <th className="text-center">เลือกเมนูนี้</th>
          </tr>
        </thead>
        <tbody>
          {data.map((item, i) => {
            return (
              <tr ref={(el) => {tr.current[i] = el;}} key={i}>
                <td>{item[0]}</td>
                <td>{item[1]}</td>
                <td className="text-center"><Button variant="primary" onClick={() => AddRow(i)}>เลือกเมนูนี้</Button></td>
              </tr>
            );
          })}
        </tbody>
      </Table>
    </>
  );
}

function App() {
  return (
    <BrowserRouter>
    <Container className="p-3 my-3 bg-light">
      <Routes>
        <Route path="/" element={<Index/>}/>
        <Route path="/main" element={<Index/>}/>
        <Route path="/product" element={<Product/>}/>
        <Route path="/contact" element={<Contact/>}/>
      </Routes>
    </Container>
    </BrowserRouter>
  );
}

export default App;